logo = """
 _____________________
|  _________________  |
| | Pythonista   0. | |  .----------------.  .----------------.  .----------------.  .----------------.
| |_________________| | | .--------------. || .--------------. || .--------------. || .--------------. |
|  ___ ___ ___   ___  | | |     ______   | || |      __      | || |   _____      | || |     ______   | |
| | 7 | 8 | 9 | | + | | | |   .' ___  |  | || |     /  \     | || |  |_   _|     | || |   .' ___  |  | |
| |___|___|___| |___| | | |  / .'   \_|  | || |    / /\ \    | || |    | |       | || |  / .'   \_|  | |
| | 4 | 5 | 6 | | - | | | |  | |         | || |   / ____ \   | || |    | |   _   | || |  | |         | |
| |___|___|___| |___| | | |  \ `.___.'\  | || | _/ /    \ \_ | || |   _| |__/ |  | || |  \ `.___.'\  | |
| | 1 | 2 | 3 | | x | | | |   `._____.'  | || ||____|  |____|| || |  |________|  | || |   `._____.'  | |
| |___|___|___| |___| | | |              | || |              | || |              | || |              | |
| | . | 0 | = | | / | | | '--------------' || '--------------' || '--------------' || '--------------' |
| |___|___|___| |___| |  '----------------'  '----------------'  '----------------'  '----------------'
|_____________________|
"""
# 함수 정의하기: add, subtract, multiply, divide
def add(n1,n2):
  return n1 + n2
def subtract(n1,n2):
  return n1 - n2
def multiply(n1,n2):
  return n1 * n2
def divide (n1,n2):
  return n1 / n2

# 연산 딕셔너리 - value는 함수이름. 즉, 함수 객체를 참조함
operations = {
  "+": add,
  "-": subtract,
  "*": multiply,
  "/": divide
}

# open program
print(logo)

# 계산기에 활용할 변수 입력 받음
num1 = float(input("What's the first number?: "))
for symbol in operations:
    print(symbol)
operation_symbol = input("Pick an operation: ")
num2 = float(input("What's the next number?: "))

# 연산 딕셔너리를 사용하여, 해당하는 함수를 호출하고 반환 값을 'answer'에 저장하세요.
answer = operations[operation_symbol](num1, num2)
#dic['key'] == value(함수 형태)--> value(매개변수)


# 결과출력. print result
print(f"{num1} {operation_symbol} {num2} = {answer}")